In [1]:
import pandas as pd
import numpy as np

pd.set_option('display.max_columns', None)  # es para enseñar todas las columnas del df
#pd.set_option('display.max_rows', None)     # es para enseñar todas las filas del df


import warnings
warnings.simplefilter('ignore')   # es para quitar warnings

## Cargo los archivos

#### Cargo tarjetas

In [2]:
'''# Leo todos los csv de la parte de tarjetas

etudiant = pd.read_csv('../data/tarjetas/Validaciones_titulo_1020.csv', sep=';')
eleve = pd.read_csv('../data/tarjetas/Validaciones_titulo_1022.csv', sep=';')
ita = pd.read_csv('../data/tarjetas/Validaciones_titulo_1033.csv', sep=';')
pass_spsm = pd.read_csv('../data/tarjetas/Validaciones_titulo_3001.csv', sep=';')
pass_ecole_jardinage = pd.read_csv('../data/tarjetas/Validaciones_titulo_3002.csv', sep=';')
pass_baplm = pd.read_csv('../data/tarjetas/Validaciones_titulo_3003.csv', sep=';')
carte_employee = pd.read_csv('../data/tarjetas/Validaciones_titulo_6020.csv', sep=';')

# Concateno todos los dataframes de tarjetas

cards = pd.concat([etudiant, eleve, ita, pass_spsm, pass_ecole_jardinage, pass_baplm, carte_employee])

# Cambio los nombres de las columna sin espacios y a minusculas.

cards.columns=[c.lower().replace(' ', '_') for c in cards.columns]

# Convierto a csv los tarjetas

cards.to_csv('../data/pasajeros/cards.csv', sep=',', index=False)
'''

"# Leo todos los csv de la parte de tarjetas\n\netudiant = pd.read_csv('../data/tarjetas/Validaciones_titulo_1020.csv', sep=';')\neleve = pd.read_csv('../data/tarjetas/Validaciones_titulo_1022.csv', sep=';')\nita = pd.read_csv('../data/tarjetas/Validaciones_titulo_1033.csv', sep=';')\npass_spsm = pd.read_csv('../data/tarjetas/Validaciones_titulo_3001.csv', sep=';')\npass_ecole_jardinage = pd.read_csv('../data/tarjetas/Validaciones_titulo_3002.csv', sep=';')\npass_baplm = pd.read_csv('../data/tarjetas/Validaciones_titulo_3003.csv', sep=';')\ncarte_employee = pd.read_csv('../data/tarjetas/Validaciones_titulo_6020.csv', sep=';')\n\n# Concateno todos los dataframes de tarjetas\n\ncards = pd.concat([etudiant, eleve, ita, pass_spsm, pass_ecole_jardinage, pass_baplm, carte_employee])\n\n# Cambio los nombres de las columna sin espacios y a minusculas.\n\ncards.columns=[c.lower().replace(' ', '_') for c in cards.columns]\n\n# Convierto a csv los tarjetas\n\ncards.to_csv('../data/pasajeros/cards.csv', sep=',', index=False)\n"

In [3]:
# Cargo los csv de tickets

cards = pd.read_csv('../data/pasajeros/cards.csv')

#### Cargo tickets

In [4]:
'''# Leo todos los csv de la parte de tickets

lunes = pd.read_excel('../data/billetes/Billetes_21032022.xlsx')
martes = pd.read_excel('../data/billetes/Billetes_22032022.xlsx')
miercoles = pd.read_excel('../data/billetes/Billetes_23032022.xlsx')
jueves = pd.read_excel('../data/billetes/Billetes_24032022.xlsx')
viernes = pd.read_excel('../data/billetes/Billetes_25032022.xlsx')
sabado = pd.read_excel('../data/billetes/Billetes_26032022.xlsx')
domingo = pd.read_excel('../data/billetes/Billetes_27032022.xlsx')

# Función para modificar el nombre de las columnas

def rename_columns(lista):
    
    for file in lista:
        
        file.columns=[c.lower().replace(' ', '_') for c in file.columns]
    
    df = pd.concat([lunes, martes, miercoles, jueves, viernes, sabado, domingo])
    
    return df

# llamo a la función para modificar las columnas

dias = [lunes, martes, miercoles, jueves, viernes, sabado, domingo]

tickets = rename_columns(dias)

# Convierto a csv los tickets

tickets.to_csv('../data/pasajeros/tickets.csv', sep=',', index=False)'''

"# Leo todos los csv de la parte de tickets\n\nlunes = pd.read_excel('../data/billetes/Billetes_21032022.xlsx')\nmartes = pd.read_excel('../data/billetes/Billetes_22032022.xlsx')\nmiercoles = pd.read_excel('../data/billetes/Billetes_23032022.xlsx')\njueves = pd.read_excel('../data/billetes/Billetes_24032022.xlsx')\nviernes = pd.read_excel('../data/billetes/Billetes_25032022.xlsx')\nsabado = pd.read_excel('../data/billetes/Billetes_26032022.xlsx')\ndomingo = pd.read_excel('../data/billetes/Billetes_27032022.xlsx')\n\n# Función para modificar el nombre de las columnas\n\ndef rename_columns(lista):\n    \n    for file in lista:\n        \n        file.columns=[c.lower().replace(' ', '_') for c in file.columns]\n    \n    df = pd.concat([lunes, martes, miercoles, jueves, viernes, sabado, domingo])\n    \n    return df\n\n# llamo a la función para modificar las columnas\n\ndias = [lunes, martes, miercoles, jueves, viernes, sabado, domingo]\n\ntickets = rename_columns(dias)\n\n# Convierto a csv los tickets\n\ntickets.to_csv('../data/pasajeros/tickets.csv', sep=',', index=False)"

In [5]:
# Cargo los csv de tickets

tickets = pd.read_csv('../data/pasajeros/tickets.csv')

#### Cargo Topologia

In [6]:
# Cargo el archivo de topologia

topologia = pd.read_csv('../data/red_transporte/topologia.csv')

# Modificio las columnas a minusculas y sin espacios.

topologia.columns=[c.lower().replace(' ', '_') for c in topologia.columns]

# Convierto a csv los tickets

# topologia.to_csv('../data/pasajeros/topologia.csv', sep=',', index=False)

In [7]:
'''# Cargo el archivo de topologia

topologia = pd.read_csv('../data/pasajeros/topologia.csv')'''

"# Cargo el archivo de topologia\n\ntopologia = pd.read_csv('../data/pasajeros/topologia.csv')"

## Limpieza de datos

#### Limpieza Cards

In [8]:
# Elimino las columnas que no quiero

cards = cards.drop(['fecha_inicio', 'fechacaducidad'], axis=1)

In [9]:
# Elimino las columnas que no quiero

cards = cards.drop(['card_title', 'waybill', 'route_name', 'line_name' ], axis=1)

In [10]:
# Cambio el formato a de fecha a datetime64

cards.date = cards.date.astype('datetime64[ns]')

In [11]:
# Me quedo con fecha inferiores al '2022-03-28'

cards =cards[cards.date < '2022-03-28']

In [12]:
# Modifico el nombre de las columnas

columnas = {'card_number': 'ticket_number', 'route': 'route_code', 'line': 'line_code', 'stop': 'stop_code', 'card_type': 'operation_type'}

cards = cards.rename(columns=columnas)

In [13]:
# Ordeno las columnas

column_names = ["date", "bus", "machine", "driver", "settlement", "ticket_number", "operation", "operation_type", "fare", "route_code", "line_code", "stop_code"]

cards = cards.reindex(columns=column_names)

In [14]:
# Cambio el tipo de dato 'ticket_number' a object

cards = cards.astype({'ticket_number': 'object'})

In [15]:
# Me quedo solo con Validaciones y Transfers

cards = cards[(cards.operation == 'Entry validation') | (cards.operation == 'Transfer (entry)')]

# Modifico lo valores de valores a Validation y Transfer

cards.operation.replace('Entry validation', 'Validation', inplace=True)
cards.operation.replace('Transfer (entry)', 'Transfer', inplace=True)

In [16]:
cards.head()

,date,bus,machine,driver,settlement,ticket_number,operation,operation_type,fare,route_code,line_code,stop_code
0,2022-03-21 05:59:28,30064,5773,2114,AA01621,43230192,Validation,Etudiant,0.0,8,203,11670
1,2022-03-21 06:03:51,30018,5828,1945,AA01567,18701088,Validation,Etudiant,0.0,38,205,10429
2,2022-03-21 06:18:53,30292,5677,1611,AA01360,2443413712,Validation,Etudiant,0.0,9,102,10986
3,2022-03-21 06:19:43,30269,5723,2077,AA01558,3472759179,Validation,Etudiant,0.0,303,202,11846
4,2022-03-21 06:19:48,30158,5553,596,AA01767,3862394236,Validation,Etudiant,0.0,8,203,11602

In [17]:
cards.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 229258 entries, 0 to 1269680
Data columns (total 12 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   date            229258 non-null  datetime64[ns]
 1   bus             229258 non-null  int64
 2   machine         229258 non-null  int64
 3   driver          229258 non-null  int64
 4   settlement      229258 non-null  object
 5   ticket_number   229258 non-null  object
 6   operation       229258 non-null  object
 7   operation_type  229258 non-null  object
 8   fare            229258 non-null  float64
 9   route_code      229258 non-null  int64
 10  line_code       229258 non-null  int64
 11  stop_code       229258 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(6), object(4)
memory usage: 22.7+ MB

#### Limpieza Tickets

In [18]:
# Sustituyo el tipo de tarifa a object y como Ticket

tickets.tarifa.replace(1, 'Ticket', inplace=True)

In [19]:
# Renombro las columnas

columnas2 = {'conductor': 'driver', 'maquina': 'machine', 'liquidacion': 'settlement', 'fecha': 'date', 'tarifa': 'operation_type', 'nombretarifa': 'operation', 'precio': 'fare', 'billete': 'ticket_number', 'linea': 'route_code', 'trayecto': 'line_code', 'parada': 'stop_code'}

tickets = tickets.rename(columns=columnas2)

In [20]:
# Ordeno las columnas

column_names = ["date", "bus", "machine", "driver", "settlement", "ticket_number", "operation", "operation_type", "fare", "route_code", "line_code", "stop_code"]

tickets = tickets.reindex(columns=column_names)

In [21]:
# Cambio el formato de fecha a datetime64

tickets.date = tickets.date.astype('datetime64[ns]')

In [22]:
# Cambio el tipo de dato 'ticket_number' a object

tickets = tickets.astype({'fare': 'float64'})

In [23]:
# Modifico el precio de los billetes

tickets.fare.replace({5000 : 5.0, 10000: 10.0, 25000 : 25.0}, inplace=True)

In [24]:
tickets.head()

,date,bus,machine,driver,settlement,ticket_number,operation,operation_type,fare,route_code,line_code,stop_code
0,2022-03-21 00:02:31,30037,5573,8888,AA01731,AI26354,ORDINAIRE,Ticket,5.0,5,102,10069
1,2022-03-21 00:02:33,30037,5573,8888,AA01731,AI26355,ORDINAIRE,Ticket,5.0,5,102,10069
2,2022-03-21 00:02:34,30037,5573,8888,AA01731,AI26356,ORDINAIRE,Ticket,5.0,5,102,10069
3,2022-03-21 00:02:36,30037,5573,8888,AA01731,AI26357,ORDINAIRE,Ticket,5.0,5,102,10069
4,2022-03-21 00:02:37,30037,5573,8888,AA01731,AI26358,ORDINAIRE,Ticket,5.0,5,102,10069

In [25]:
tickets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1251553 entries, 0 to 1251552
Data columns (total 12 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   date            1251553 non-null  datetime64[ns]
 1   bus             1251553 non-null  int64
 2   machine         1251553 non-null  int64
 3   driver          1251553 non-null  int64
 4   settlement      1251553 non-null  object
 5   ticket_number   1251553 non-null  object
 6   operation       1251553 non-null  object
 7   operation_type  1251553 non-null  object
 8   fare            1251553 non-null  float64
 9   route_code      1251553 non-null  int64
 10  line_code       1251553 non-null  int64
 11  stop_code       1251553 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(6), object(4)
memory usage: 114.6+ MB

#### Concateno los dataframes

In [26]:
# Concateno todos los dataframes de billetes y tarjetas

passengers = pd.concat([tickets, cards])

In [27]:
# Convierto a csv los pasajeros

passengers.to_csv('../data/pasajeros/passengers.csv', sep=',', index=False)

#### Topologia

In [28]:
# Renombro las columnas

columnas3 = {'route_code_gmv': 'route_code', 'route': 'route_name', 'route_name': 'route_name_int', 'stop_code_gmv': 'stop_code', 'stop_code_alsa': 'stop_code_int'}

In [29]:
topologia = topologia.rename(columns=columnas3)

In [30]:
topologia.head()

,route_code,route_name,route_name_int,line_code,line_name,stop_order,stop_code,stop_name,stop_code_int,latitude,longitude
0,1,L1,L1 BAB CHELLAH-DOHA,103,BAB CHALLEH-DOHA,1,10005,Bab Chellah,73006,"34,02329786","-6,834576334"
1,1,L1,L1 BAB CHELLAH-DOHA,103,BAB CHALLEH-DOHA,2,10007,Bab Mellah,73008,"34,02500069","-6,829615092"
2,1,L1,L1 BAB CHELLAH-DOHA,103,BAB CHALLEH-DOHA,3,10044,Bab Khmiss,73046,"34,03663288","-6,817232328"
3,1,L1,L1 BAB CHELLAH-DOHA,103,BAB CHALLEH-DOHA,4,10046,Diar,73048,"34,04143426","-6,816443938"
4,1,L1,L1 BAB CHELLAH-DOHA,103,BAB CHALLEH-DOHA,5,10048,Mkinsiya,73050,"34,04413576","-6,817705018"

In [31]:
topologia = topologia.drop(['route_name_int'], axis=1)

In [32]:
topologia.line_name = topologia.line_name.fillna('AEROPORT-GARE AGDAL')

In [33]:
topologia.to_csv('../data/pasajeros/topologia.csv', sep=',', index=False)

## Joins entre tablas (creo passenger_location)

In [34]:
passengers.head()

,date,bus,machine,driver,settlement,ticket_number,operation,operation_type,fare,route_code,line_code,stop_code
0,2022-03-21 00:02:31,30037,5573,8888,AA01731,AI26354,ORDINAIRE,Ticket,5.0,5,102,10069
1,2022-03-21 00:02:33,30037,5573,8888,AA01731,AI26355,ORDINAIRE,Ticket,5.0,5,102,10069
2,2022-03-21 00:02:34,30037,5573,8888,AA01731,AI26356,ORDINAIRE,Ticket,5.0,5,102,10069
3,2022-03-21 00:02:36,30037,5573,8888,AA01731,AI26357,ORDINAIRE,Ticket,5.0,5,102,10069
4,2022-03-21 00:02:37,30037,5573,8888,AA01731,AI26358,ORDINAIRE,Ticket,5.0,5,102,10069

#### JOIN (REVISAR)

In [35]:
# Hago un left join entre 'passengers'  y 'topologia' para obtener 'route_name', 'line_name', 'stop_order', 'stop_name', 'latitude', 'longitude' 


passenger_location = passengers.set_index(['route_code', 'line_code', 'stop_code']).join(topologia[['route_code', 'line_code', 'stop_code', 'route_name', 'line_name', 'stop_order', 'stop_name', 'latitude', 'longitude']].set_index(['route_code', 'line_code', 'stop_code']))

In [36]:
# Reseteo el indice

passenger_location.reset_index(inplace=True)

In [38]:
# Modifico el dataset en el que elimino todas las filas con algún datos nulos


passenger_location = passenger_location[passenger_location[['route_name', 'line_name', 'stop_order', 'stop_name', 'latitude', 'longitude']].notnull().any(axis=1)]

In [39]:
# Ordeno las columnas

column_names2 = ["date", "bus", "machine", "driver", "settlement", "ticket_number", "operation", "operation_type", "fare", "route_code","route_name", "line_code", "line_name", "stop_code", "stop_name", "stop_order", "latitude", "longitude"]

passenger_location = passenger_location.reindex(columns=column_names2)

In [40]:
# Cambio el tipo de dato 'stop_order' a int

passenger_location = passenger_location.astype({'stop_order': 'int64'})

In [43]:
passenger_location.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1414810 entries, 0 to 1498342
Data columns (total 18 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   date            1414810 non-null  datetime64[ns]
 1   bus             1414810 non-null  int64
 2   machine         1414810 non-null  int64
 3   driver          1414810 non-null  int64
 4   settlement      1414810 non-null  object
 5   ticket_number   1414810 non-null  object
 6   operation       1414810 non-null  object
 7   operation_type  1414810 non-null  object
 8   fare            1414810 non-null  float64
 9   route_code      1414810 non-null  int64
 10  route_name      1414810 non-null  object
 11  line_code       1414810 non-null  int64
 12  line_name       1414810 non-null  object
 13  stop_code       1414810 non-null  int64
 14  stop_name       1414810 non-null  object
 15  stop_order      1414810 non-null  int64
 16  latitude        1414810 non-null  object
 17  longitude       1414810 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(7), object(9)
memory usage: 205.1+ MB

In [41]:
# Convierto a csv los pasajeros

passenger_location.to_csv('../data/pasajeros/passenger_location.csv', sep=',', index=False)